



Network Working Group                                              Z. Li
Internet-Draft                                              China Mobile
Intended status: Standards Track                                 M. Chen
Expires: January 7, 2021                                          Huawei
                                                           July 06, 2020


                     Performance Measurement on LAG
                       draft-li-ippm-pm-on-lag-00

Abstract

   This document defines extensions to One-way Active Measurement
   Protocol (OWAMP), Two-way Active Measurement Protocol (TWAMP), and
   Simple Two-Way Active Measurement Protocol (STAMP) to implement
   performance measurement on every member link of a Link Aggregation
   Group (LAG).  With the measured metrics of each member links of a
   LAG, it enables operators to enforce performance metric based traffic
   steering policy among the member links.

Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in
   [RFC2119] [RFC8174] when, and only when, they appear in all capitals,
   as shown here.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on January 7, 2021.







Li & Chen                Expires January 7, 2021                [Page 1]

Internet-Draft                  PM on LAG                      July 2020


Copyright Notice

   Copyright (c) 2020 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents
   (https://trustee.ietf.org/license-info) in effect on the date of
   publication of this document.  Please review these documents
   carefully, as they describe your rights and restrictions with respect
   to this document.  Code Components extracted from this document must
   include Simplified BSD License text as described in Section 4.e of
   the Trust Legal Provisions and are provided without warranty as
   described in the Simplified BSD License.

Table of Contents

   1.  Problem Statement . . . . . . . . . . . . . . . . . . . . . .   2
   2.  Micro Session on LAG  . . . . . . . . . . . . . . . . . . . .   3
   3.  Mirco OWAMP Session . . . . . . . . . . . . . . . . . . . . .   4
     3.1.  Micro OWAMP-Control . . . . . . . . . . . . . . . . . . .   4
     3.2.  Micro OWAMP-Test  . . . . . . . . . . . . . . . . . . . .   4
   4.  Mirco TWAMP Session . . . . . . . . . . . . . . . . . . . . .   4
     4.1.  Micro TWAMP-Control . . . . . . . . . . . . . . . . . . .   5
     4.2.  Micro TWAMP-Test  . . . . . . . . . . . . . . . . . . . .   5
       4.2.1.  Sender Behavior . . . . . . . . . . . . . . . . . . .   5
       4.2.2.  Reflector Behavior  . . . . . . . . . . . . . . . . .   7
   5.  Mirco STAMP Session . . . . . . . . . . . . . . . . . . . . .  10
     5.1.  Micro STAMP-Test  . . . . . . . . . . . . . . . . . . . .  10
       5.1.1.  Session-Sender Packet Format  . . . . . . . . . . . .  10
       5.1.2.  Session-Reflector Packet Format . . . . . . . . . . .  12
       5.1.3.  Micro STAMP-Test Procedures . . . . . . . . . . . . .  15
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .  15
     6.1.  Mico OWAMP-Control Command  . . . . . . . . . . . . . . .  15
     6.2.  Mico TWAMP-Control Command  . . . . . . . . . . . . . . .  15
   7.  Security Considerations . . . . . . . . . . . . . . . . . . .  16
   8.  Acknowledgements  . . . . . . . . . . . . . . . . . . . . . .  16
   9.  References  . . . . . . . . . . . . . . . . . . . . . . . . .  16
     9.1.  Normative References  . . . . . . . . . . . . . . . . . .  16
     9.2.  Informative References  . . . . . . . . . . . . . . . . .  16
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .  16

1.  Problem Statement

   Link Aggregation Group (LAG), as defined in [IEEE802.1AX], provides
   mechanisms to combine multiple physical links into a single logical
   link.  This logical link provides higher bandwidth and better
   resiliency, because if one of the physical member links fails, the



Li & Chen                Expires January 7, 2021                [Page 2]

Internet-Draft                  PM on LAG                      July 2020


   aggregate logical link can continue to forward traffic over the
   remaining operational physical member links.

   Normally, when forwarding traffic over a LAG, a hash based or the
   like mechanism is used to load balance the traffic among member links
   of the LAG.  In some cases, the link delays of the member links are
   different because the member links are over different transport
   paths.  To provide low delay service to time sensitive traffic, we
   have to know the link delay of each member link of a LAG and then
   steer traffic accordingly.  This requires a solution that could
   measure the performance metrics of each member link of a LAG.

   However, when using One-way Active Measurement Protocol (OWAMP)
   [RFC4656], Two-way Active Measurement Protocol (TWAMP) [RFC5357], or
   Simple Two-Way Active Measurement Protocol (STAMP) [RFC8762] to
   measure the performance of a LAG, the LAG is treated as a single
   logical link/path.  The measured metrics reflect the performance of
   one member link or an average of some/all member links of the LAG.

   This document defines extensions to OWAMP [RFC4656], TWAMP [RFC5357]
   or STAMP [RFC8762] to implement performance measurement on every
   member link of a LAG.

2.  Micro Session on LAG

   To measure performance metrics of every member link of a LAG,
   multiple sessions (one session for each member link) need to be
   established between the two hosts that are connected by the LAG.
   These sessions are called micro sessions in the remainder of this
   document.

   From the OWAMP/TWAMP-Control point of view, micro sessions of a LAG
   share the same Sender Address, Receiver Address, have different
   Session Identifiers (SID).  As for the Sender Port and Receiver Port,
   micro sessions may share the same Sender Port and Receiver Port pair,
   or each micro session is configured with different Sender Port and
   Receiver Port pair.  But from simplifying operation point of view,
   the former is recommended.

   In addition, with micro sessions, there needs a way to correlate a
   session with a member link.  For example, when receives a Control or
   Test packet, the Server/Reflector/Receiver needs to know from which
   member link the packet is received, and then correlate the packet
   with a micro session.  This is different from the existing OWAMP
   [RFC4656], TWAMP [RFC5357], or STAMP [RFC8762].

   This document defines new command types to indicate that a session is
   a micro session, the details are described in Section 3 and 4 of this



Li & Chen                Expires January 7, 2021                [Page 3]

Internet-Draft                  PM on LAG                      July 2020


   document.  For a micro session, on receiving of a Control/Test
   packet, the receiver uses the receiving link to correlate the packet
   with a particular session.  In the case of two-way measurement, Test
   packets may need to carry the member link related information for
   valid checking.  For example, when a Sender receives a reflected Test
   packet, it may needs to check whether the Test packet is from the
   expected member link.

3.  Mirco OWAMP Session

   This document assumes that the OWAMP Server and the OWAMP Receiver of
   an OWAMP micro session are at the same host.

3.1.  Micro OWAMP-Control

   To support micro OWAMP session, a new command, which is referred to
   as Request-OW-Micro-Session (TBD1), is defined in this document.  The
   Request-OW-Micro-Session command is based on the OWAMP Request-
   Session command, and uses the message format as described in
   Section 3.5 of OWAMP [RFC4656].  Test session creation of micro OWAMP
   session follows the same procedure as defined in Section 3.5 of OWAMP
   [RFC4656] with the following additions:

   When a OWAMP Server receives a Request-OW-Micro-Session command, if
   the Session is accepted, the OWAMP Server MUST build an association
   between the session and the member link from which the Request-
   Session message is received.

3.2.  Micro OWAMP-Test

   Micro OWAMP-Test reuses the OWAMP-Test packet format and procedures
   as defined in Section 4 of OWAMP [RFC4656] with the following
   additions:

   The micro OWAMP Sender MUST send the micro OWAMP-Test packets over
   the member link with which the session is associated.  When receives
   a Test packet, the micro OWAMP receiver MUST use the member link from
   which the Test packet is received to correlate the micro OWAMP
   session.

4.  Mirco TWAMP Session

   As above, this document assumes that the TWAMP Server and the TWAMP
   Session-Reflector of a micro OWAMP session are at the same host.







Li & Chen                Expires January 7, 2021                [Page 4]

Internet-Draft                  PM on LAG                      July 2020


4.1.  Micro TWAMP-Control

   To support micro TWAMP session, a new command, which is referred to
   as Request-TW-Micro-Session (TBD2), is defined in this document.  The
   Request-TW-Micro-Session command is based on the TWAMP Request-
   Session command, and uses the message format as described in
   Section 3.5 of TWAMP [RFC5357].  Test session creation of micro TWAMP
   session follows the same procedure as defined in Section 3.5 of TWAMP
   [RFC5357] with the following additions:

   When a micro TWAMP Server receives a Request-TW-Micro-Session
   command, if the micro TWAMP Session is accepted, the micro TWAMP
   Server MUST build an association between the session and the member
   link from which the Request-Session message is received.

4.2.  Micro TWAMP-Test

   The micro TWAMP-Test protocol is based on the TWAMP-Test protocol
   [RFC5357] with the following extensions.

4.2.1.  Sender Behavior

   In addition to inheriting the TWAMP sender behavior as defined
   Section 4.1 of [RFC5357], the micro TWAMP Session-Sender MUST send
   the micro TWAMP-Test packets over the member link with which the
   session is associated.

   The micro TWAMP Session-Sender may carry an identifier of the member
   link that is going to be measured by the micro TWAMP session.  The
   micro TWAMP Session-Reflector MUST copy the member link identifier in
   the response Test packet.  The micro TWAMP Sender can use it to check
   whether the reflected Test packet is correctly transmitted over the
   expected member link.

4.2.1.1.  Packet Format and Content

   The micro TWAMP Session-Sender packet format is based on the TWAMP
   Session-Sender packet format as defined in Section 4.1.2 of
   [RFC5357].  In addition, in order to carry the LAG member link
   identifier, a new field is added.  The formats are as below:

   For unauthenticated mode:









Li & Chen                Expires January 7, 2021                [Page 5]

Internet-Draft                  PM on LAG                      July 2020


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Sequence Number                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Timestamp                            |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |        Error Estimate         |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                Sender Member Link ID (6 octets)               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       .                         Packet Padding                        .
       .                                                               .
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

        Figure 1: Session-Sender Packet format in Unauthenticated Mode


   For authenticated mode:





























Li & Chen                Expires January 7, 2021                [Page 6]

Internet-Draft                  PM on LAG                      July 2020


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Sequence Number                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                        MBZ (12 octets)                        |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Timestamp                            |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |        Error Estimate         |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               |
       |                   Sender Member Link ID (6 octets)            |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                       HMAC (16 octets)                        |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       .                        Packet Padding                         .
       .                                                               .
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

        Figure 2: Session-Sender Packet Format in Authenticated Mode

   Except for the Sender Member Link ID field, all the other fields are
   the same as defined in Section 4.1.2 of TWAMP [RFC5357], which is
   originally defined in Section 4.1.2 of OWAMP [RFC4656].  Therefore,
   it follows the same procedure and guidelines as defined in
   Section 4.1.2 of TWAMP [RFC5357].

   The Sender Member Link ID (6-octets in length): It is defined for the
   Session-Sender to carry the identifier of the member link that is
   being measured.  The Sender Member Link ID MUST be unique at the
   Session-Sender.

4.2.2.  Reflector Behavior

   The micro TWAMP Session-Reflector inherits the behaviors of a TWAMP
   Session-Reflector as defined in Section 4.2 of [RFC5357].

   In addition, when receives a Test packet, the micro TWAMP Session-
   Reflector MUST use the member link from which the Test packet is
   received to correlate to a micro TWAMP session.  When sends a



Li & Chen                Expires January 7, 2021                [Page 7]

Internet-Draft                  PM on LAG                      July 2020


   response to a received Test packet, the micro TWAMP Session-Reflector
   MUST copy the LAG Member Link ID to the response Test packet.

4.2.2.1.  Packet Format and Content

   The micro TWAMP Session-Reflector packet format is based on the TWAMP
   Session-Reflector packet format as defined in Section 4.2.1 of
   [RFC5357].  In addition, in order to carry the LAG member link
   identifier, a new field is added.  The formats are as below:

   For unauthenticated mode:

      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Sequence Number                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Timestamp                            |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |         Error Estimate        |           MBZ                 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Receive Timestamp                    |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Sender Sequence Number                 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Sender Timestamp                         |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      Sender Error Estimate    |           MBZ                 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  Sender TTL   |                   MBZ                         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                    Sender Member Link ID (6 octets)           |
      +                               +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                               |                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               .
      .                                                               .
      .                         Packet Padding                        .
      .                                                               .
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Figure 3: Session-Reflector Packet Format in Unauthenticated Mode

   For authenticated and encrypted modes:




Li & Chen                Expires January 7, 2021                [Page 8]

Internet-Draft                  PM on LAG                      July 2020


      0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Sequence Number                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        MBZ (12 octets)                        |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                          Timestamp                            |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |         Error Estimate        |                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
      |                Sender Member Link ID (6 octets)               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Receive Timestamp                      |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        MBZ (8 octets)                         |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Sender Sequence Number                 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        MBZ (12 octets)                        |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Sender Timestamp                         |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      Sender Error Estimate    |                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
      |                        MBZ (6 octets)                         |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  Sender TTL   |                                               |
      +-+-+-+-+-+-+-+-+                                               +
      |                                                               |
      |                                                               |
      |                        MBZ (15 octets)                        |
      +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
      |                        HMAC (16 octets)                       |
      |                                                               |
      |                                                               |
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      .                         Packet Padding                        .



Li & Chen                Expires January 7, 2021                [Page 9]

Internet-Draft                  PM on LAG                      July 2020


      .                                                               .
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

      Figure 4: Session-Reflector Packet Format in Authenticated Mode

   Except for the Sender Member Link ID field, all the other fields are
   the same as defined in Section 4.2.1 of TWAMP [RFC5357].  Therefore,
   it follows the same procedure and guidelines as defined in
   Section 4.2.1 of TWAMP [RFC5357].

   Sender Member Link ID (6-octets in length): it is defined for
   carrying the LAG Member Link ID copied from the Session-Sender Test
   packet.

5.  Mirco STAMP Session

5.1.  Micro STAMP-Test

   The micro STAMP-Test protocol is based on the STAMP-Test protocol
   [RFC8762] with the following extensions.

5.1.1.  Session-Sender Packet Format

   The micro STAMP Session-Sender Test packet formats are based on the
   STAMP Session-Sender Test packet formats and with some extensions (a
   new field: LAG Member Link ID is introduced).  The formats are as
   follows:























Li & Chen                Expires January 7, 2021               [Page 10]

Internet-Draft                  PM on LAG                      July 2020


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Sequence Number                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Timestamp                            |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         Error Estimate        |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                Sender Member Link ID (6 octets)               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                        MBZ  (28 octets)                       |
       |                                                               |
       |                                                               |
       |                                                               |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         Figure 5: Session-Sender Test Packet in Unauthenticated Mode





























Li & Chen                Expires January 7, 2021               [Page 11]

Internet-Draft                  PM on LAG                      July 2020


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                      Sequence Number                          |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                      MBZ (12 octets)                          |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Timestamp                              |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |        Error Estimate         |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                Sender Member Link ID (6 octets)               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       ~                                                               ~
       |                         MBZ (64 octets)                       |
       ~                                                               ~
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                                                               |
       |                       HMAC (16 octets)                        |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
          Figure 6: Session-Sender Test Packet in Authenticated Mode

   Except for the Sender Member Link ID field, all the other fields are
   the same as defined in Section 4.2.1 and 4.2.2 of STAMP [RFC8762].

   Sender Member Link ID (6-octets in length): it is defined for the
   Session-Sender to carry the identifier of the member link that is
   being measured.  The Sender Member Link ID MUST be unique at the
   Session-Sender.

5.1.2.  Session-Reflector Packet Format

   The micro STAMP Session-Reflector Test packet formats are based on
   the STAMP Session-Reflector Test packet formats with a minor
   extension (a new field: LAG Member Link ID is introduced).  The
   formats are as follows:










Li & Chen                Expires January 7, 2021               [Page 12]

Internet-Draft                  PM on LAG                      July 2020


        0                   1                   2                   3
        0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Sequence Number                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Timestamp                            |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         Error Estimate        |              MBZ              |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Receive Timestamp                    |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                 Session-Sender Sequence Number                |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                  Session-Sender Timestamp                     |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       | Session-Sender Error Estimate |            MBZ                |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |Ses-Sender TTL |     MBZ       |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                LAG Member Link ID (6 octets)                  |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

       Figure 7: Session-Reflector Test Packet in Unauthenticated Mode

























Li & Chen                Expires January 7, 2021               [Page 13]

Internet-Draft                  PM on LAG                      July 2020


       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Sequence Number                        |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        MBZ (12 octets)                        |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                          Timestamp                            |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |         Error Estimate        |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                Sender Member Link ID (6 octets)               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        Receive Timestamp                      |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        MBZ (8 octets)                         |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                 Session-Sender Sequence Number                |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        MBZ (12 octets)                        |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                 Session-Sender Timestamp                      |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       | Session-Sender Error Estimate |                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
       |                        MBZ (6 octets)                         |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |Ses-Sender TTL |                                               |
       +-+-+-+-+-+-+-+-+                                               +
       |                                                               |
       |                        MBZ (15 octets)                        |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
       |                        HMAC (16 octets)                       |
       |                                                               |
       |                                                               |
       |                                                               |
       +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

        Figure 8: Session-Reflector Test Packet in Authenticated Mode



Li & Chen                Expires January 7, 2021               [Page 14]

Internet-Draft                  PM on LAG                      July 2020


   Except for the Sender Member Link ID field, all the other fields are
   the same as defined in Section 4.3.1 and 4.3.2 of STAMP [RFC8762].

   Sender Member Link ID (6-octets in length): it is defined for
   carrying the Sender Member Link ID copied from the Session-Sender
   Test packet.

5.1.3.  Micro STAMP-Test Procedures

   The micro STAMP-Test reuses the procedures as defined in Section 4 of
   STAMP [RFC8762] with the following additions:

   The micro STAMP Session-Sender MUST send the micro STAMP-Test packets
   over the member link with which the session is associated.  When
   receives a Test packet, the micro STAMP Session-Reflector MUST use
   the member link from which the Test packet is received to correlate
   to a micro STAMP session.

   The micro STAMP Session-Sender may carry an identifier of the member
   link that is related to this micro STAMP session in the Session-
   Sender Test packet.  The micro STAMP Session-Reflector MUST copy it
   to the Session-Reflector Test packet (Section 5.1.2 of this document)
   and send it back to the micro STAMP Session-Sender.  The micro STAMP
   Session-Sender can use it to check whether the reflected Test packet
   is correctly transmitted over the expected member link.

6.  IANA Considerations

6.1.  Mico OWAMP-Control Command

   This document requires the IANA to allocate the following command
   type from OWAMP-Control Command Number Registry.

   Value  Description                   Semantics Definition
   TBD1   Request-OW-Micro-Session      This document, Section 3.1

6.2.  Mico TWAMP-Control Command

   This document requires the IANA to allocate the following command
   type from TWAMP-Control Command Number Registry.

   Value  Description                   Semantics Definition
   TBD1   Request-TW-Micro-Session      This document, Section 4.1








Li & Chen                Expires January 7, 2021               [Page 15]

Internet-Draft                  PM on LAG                      July 2020


7.  Security Considerations

   The security considerations in [RFC4656], [RFC5357], [RFC8762] apply
   to this document.

8.  Acknowledgements

9.  References

9.1.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC4656]  Shalunov, S., Teitelbaum, B., Karp, A., Boote, J., and M.
              Zekauskas, "A One-way Active Measurement Protocol
              (OWAMP)", RFC 4656, DOI 10.17487/RFC4656, September 2006,
              <https://www.rfc-editor.org/info/rfc4656>.

   [RFC5357]  Hedayat, K., Krzanowski, R., Morton, A., Yum, K., and J.
              Babiarz, "A Two-Way Active Measurement Protocol (TWAMP)",
              RFC 5357, DOI 10.17487/RFC5357, October 2008,
              <https://www.rfc-editor.org/info/rfc5357>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

   [RFC8762]  Mirsky, G., Jun, G., Nydell, H., and R. Foote, "Simple
              Two-Way Active Measurement Protocol", RFC 8762,
              DOI 10.17487/RFC8762, March 2020,
              <https://www.rfc-editor.org/info/rfc8762>.

9.2.  Informative References

   [IEEE802.1AX]
              IEEE Std. 802.1AX, "IEEE Standard for Local and
              metropolitan area networks - Link Aggregation", November
              2008.

Authors' Addresses

   Zhenqiang Li
   China Mobile

   Email: li_zhenqiang@hotmail.com



Li & Chen                Expires January 7, 2021               [Page 16]

Internet-Draft                  PM on LAG                      July 2020


   Mach(Guoyi) Chen
   Huawei

   Email: mach.chen@huawei.com















































Li & Chen                Expires January 7, 2021               [Page 17]
